In [1]:
import pandas as pd
#import pandas_profiling
from matplotlib import pyplot as plt
import seaborn as sns

%matplotlib inline
pd.set_option('display.max_columns', 100)

In [2]:
tableAutomoviles = '1.csv'
tableMotocicletas = '2.csv'

In [3]:
vehiculos = pd.read_csv(tableAutomoviles)
motocicletas = pd.read_csv(tableMotocicletas)

In [4]:
vehiculos.shape

(4452, 33)

In [5]:
vehiculos.columns

Index(['ID', 'TIPO', 'CLASE', 'MARCA', 'LINEA', 'CILINDRAJE', 'TONELAJE',
       'PASAJE', 'MODELOS', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11',
       'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15',
       'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19',
       'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23',
       'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27',
       'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31',
       'Unnamed: 32'],
      dtype='object')

In [6]:
motocicletas.columns

Index(['ID', 'TIPO', 'CLASE', 'MARCA', 'LINEA', 'CILINDRAJE', 'TONELAJE',
       'PASAJE', 'MODELOS', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11',
       'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15',
       'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19',
       'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23',
       'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27',
       'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31',
       'Unnamed: 32'],
      dtype='object')

In [7]:
vehiculos.head()

,ID,TIPO,CLASE,MARCA,LINEA,CILINDRAJE,TONELAJE,PASAJE,MODELOS,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
1,28681.0,AUTOMﾃ天ILES,AUTOMOVIL,ACCURA,ACURA,3200.0,NaN,NaN,14900,16300,17400,18500,19700,21000,22300,23800,25300,27000,28700,30600,32500,34600,36800,39300,41800,44500,47300,50400,53600,57100,60800,63900,68900
2,25668.0,AUTOMﾃ天ILES,AUTOMOVIL,ACURA,INTEGRA (LINEA BASE ESTANDAR),1800.0,0,0.0,4930,5950,6400,6900,7380,7870,8520,9200,9870,10650,11400,12260,13220,14090,15240,16390,17530,18880,20320,21850,23480,25310,27310,28660,31000
3,1.0,AUTOMﾃ天ILES,AUTOMOVIL,ACURA,INTEGRA 1.8 2P MT,1800.0,0,0.0,6240,7380,7870,8340,8900,9580,10260,10830,11600,12460,13320,14090,15140,16190,17250,18410,19750,20990,22420,23970,25590,27310,29520,30960,33100
4,2.0,AUTOMﾃ天ILES,AUTOMOVIL,ACURA,INTEGRA 1.8 VTEC 4P MT,1797.0,0,0.0,4930,5950,6400,6900,7380,7870,8520,9200,9870,10650,11400,12260,13220,14090,15240,16390,17530,18880,20320,21850,23480,25310,27310,28660,31000

In [8]:
motocicletas.head()

,ID,TIPO,CLASE,MARCA,LINEA,CILINDRAJE,TONELAJE,PASAJE,MODELOS,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1994,1995.0,1996.0,1997.0,1998.0,1999.0,2000.0,2001.0,2002.0,2003.0,2004.0,2005.0,2006.0,2007.0,2008.0,2009.0,2010.0,2011.0,2012.0,2013.0,2014.0,2015.0,2016.0,2017.0,2018.0
1,7881.0,MOTOCICLETAS Y\nMOTOCARROS,MOTOCICLETA,ACB,ACB 125 MT,125,0.0,0.0,370,380.0,380.0,380.0,380.0,380.0,380.0,480.0,577.0,670.0,760.0,860.0,860.0,860.0,957.0,1050.0,1150.0,1246.0,1340.0,1440.0,1630.0,1720.0,1910.0,2010.0,2100.0
2,7882.0,MOTOCICLETAS Y\nMOTOCARROS,MOTOCICLETA,ACB,B-STRONG 110 MT,107,0.0,0.0,370,380.0,380.0,380.0,380.0,380.0,380.0,480.0,577.0,670.0,760.0,830.0,875.0,916.0,957.0,1010.0,1060.0,1080.0,1100.0,1150.0,1246.0,1340.0,1440.0,1510.0,1800.0
3,7883.0,MOTOCICLETAS Y\nMOTOCARROS,MOTOCICLETA,ACB,FORTRESS 125 AT,125,0.0,0.0,370,380.0,380.0,380.0,480.0,577.0,670.0,760.0,760.0,760.0,860.0,957.0,1050.0,1150.0,1246.0,1246.0,1440.0,1630.0,1720.0,1910.0,2110.0,2200.0,2400.0,2520.0,3000.0
4,7884.0,MOTOCICLETAS Y\nMOTOCARROS,MOTOCICLETA,ACB,MONTANA 200 MT,200,0.0,0.0,370,380.0,380.0,380.0,380.0,380.0,380.0,380.0,380.0,480.0,480.0,480.0,480.0,577.0,670.0,760.0,860.0,860.0,957.0,957.0,1050.0,1150.0,1246.0,1310.0,1500.0

# Analisis Vehiculos

In [9]:
vehiculos = vehiculos[vehiculos.ID.notnull()]
vehiculos = vehiculos[['CLASE','MARCA', 'LINEA']]

In [10]:
vehiculos.head()

       CLASE   MARCA                          LINEA
1  AUTOMOVIL  ACCURA                          ACURA
2  AUTOMOVIL   ACURA  INTEGRA (LINEA BASE ESTANDAR)
3  AUTOMOVIL   ACURA              INTEGRA 1.8 2P MT
4  AUTOMOVIL   ACURA         INTEGRA 1.8 VTEC 4P MT
5  AUTOMOVIL   ACURA                LEGEND KA766P-L

In [11]:
vehiculos.CLASE.value_counts()

AUTOMOVIL             4450
AUTOMOVIL -\nBUGGY       1
Name: CLASE, dtype: int64

In [12]:
vehiculos = vehiculos[vehiculos.CLASE != "AUTOMOVIL -\nBUGGY"]

In [13]:
vehiculos.CLASE.value_counts()

AUTOMOVIL    4450
Name: CLASE, dtype: int64

In [14]:
motocicletas = motocicletas[motocicletas.ID.notnull()]
motocicletas = motocicletas[['CLASE','MARCA', 'LINEA']]

In [15]:
motocicletas.head()

         CLASE MARCA            LINEA
1  MOTOCICLETA   ACB       ACB 125 MT
2  MOTOCICLETA   ACB  B-STRONG 110 MT
3  MOTOCICLETA   ACB  FORTRESS 125 AT
4  MOTOCICLETA   ACB   MONTANA 200 MT
5  MOTOCICLETA   ACB   TORNADO 200 MT

# Concatenas tablas

In [16]:
vehiculos = vehiculos.append(motocicletas)
vehiculospruebas = vehiculos.append(motocicletas)

### reparando strings con caracter \n

In [17]:
#caracter = '\n'
caracter = 'Motocicleta'
prueba = 'Hola\nmundo'

In [18]:
prueba.replace(caracter,' ')

'Hola\nmundo'

In [19]:
#funcion para eliminar todos los \n
def reparar(row,caracter = 'Motocicleta' ,change = 'MOTOCICLETA'):
    row.CLASE = row.CLASE.replace(caracter,change)
    row.MARCA = row.MARCA.replace(caracter,change)
    row.LINEA = row.LINEA.replace(caracter,change)
    return row

In [20]:
vehiculos = vehiculos.apply(reparar,axis = 1)

In [48]:
vehiculos.shape

(7085, 3)

In [21]:
vehiculos.head()

       CLASE   MARCA                          LINEA
1  AUTOMOVIL  ACCURA                          ACURA
2  AUTOMOVIL   ACURA  INTEGRA (LINEA BASE ESTANDAR)
3  AUTOMOVIL   ACURA              INTEGRA 1.8 2P MT
4  AUTOMOVIL   ACURA         INTEGRA 1.8 VTEC 4P MT
5  AUTOMOVIL   ACURA                LEGEND KA766P-L

In [22]:
vehiculos[vehiculos.MARCA == 'ACURA']

       CLASE  MARCA                                              LINEA
2  AUTOMOVIL  ACURA                      INTEGRA (LINEA BASE ESTANDAR)
3  AUTOMOVIL  ACURA                                  INTEGRA 1.8 2P MT
4  AUTOMOVIL  ACURA                             INTEGRA 1.8 VTEC 4P MT
5  AUTOMOVIL  ACURA                                    LEGEND KA766P-L
6  AUTOMOVIL  ACURA  LINEAS y CILINDRAJE NO INCLUIDAS DE ESTA MARCA...
7  AUTOMOVIL  ACURA                                         TL 2.5L AT
8  AUTOMOVIL  ACURA                                         TL 3.2L AT
9  AUTOMOVIL  ACURA                                       TSX 2.4 L AT

In [23]:
vehiculos.CLASE.value_counts()

AUTOMOVIL                 4450
MOTOCICLETA               2011
CUATRIMOTO                 326
MOTOCARRO                  241
MOTOCICLETA\nELECTRICA      38
MOTOCARRO\nELECTRICO        17
MOTOTRICICLO                 2
Name: CLASE, dtype: int64

In [24]:
vehiculos.MARCA.value_counts()

BMW                   489
MERCEDES BENZ         336
HONDA                 322
VOLKSWAGEN            255
RENAULT               251
CHEVROLET             232
YAMAHA                229
MAZDA                 208
PEUGEOT               204
HYUNDAI               201
AUDI                  192
SUZUKI                172
KIA                   152
NISSAN                150
VOLVO                 140
KAWASAKI              133
CITROEN               123
HARLEY DAVIDSON       121
BRP CAN AM            113
FIAT                  113
AUTECO                113
TOYOTA                110
FORD                  108
SKODA                 100
AKT                    97
SEAT                   88
SUBARU                 74
KTM                    73
DUCATI                 72
PORSCHE                70
                     ...
PANTERA                 1
ZIMMER                  1
RAMBLER                 1
HAMMERHEAD              1
SKOOT\nMOTORCYCLES      1
HILTRAYKER              1
BENTLEY                 1
XINLING                 1
AUTO UNION              1
BSA                     1
EKA MOTORS              1
AUTOKRAFT               1
ROLLS ROYCE             1
WILLYGER                1
BERRECO                 1
LINGYUN                 1
MZ                      1
GSMOON                  1
HUDSON                  1
YCF                     1
ZILI MOTORS             1
FRIBEST                 1
BRONCO                  1
WESTFIELD               1
DESOTO                  1
OAKLAND                 1
KANCHAO                 1
JIANGSU                 1
APRIL                   1
KONCEO                  1
Name: MARCA, Length: 416, dtype: int64

In [25]:
print("Clase: ",vehiculos.CLASE.isnull().sum())
print("Marca: ",vehiculos.MARCA.isnull().sum())
print("Linea: ",vehiculos.LINEA.isnull().sum())

Clase:  0
Marca:  0
Linea:  0

In [26]:
marcasvehiculos = set(vehiculos.MARCA.get_values())
marcasvehiculos = list(marcasvehiculos)
print(marcasvehiculos)

['YGM', 'MASERATI', 'XILING', 'BRITISH', 'MOTO ABC', 'ZIP STAR', 'ATV RATO', 'BOMBARDER', 'HUNTER', 'GLOW', 'JEZHANG', 'ISO', 'TAVRIA', 'THUNDER CYCLE', 'BMW', 'LML', 'SANDI', 'YCF', 'BUGGY', 'BERRECO', 'HARLEY DAVIDFSON', 'ZNEN', 'JINLING', 'LIZHONG', 'UKM', 'WARZAWA', 'DONGBEN', 'HAIMA', 'SUNBEAM', 'COBRA', 'BORGO', 'NORTON', 'TEAN RYDER', 'UNISON', 'SYM', 'YAMASAKY', 'JIANSHE', 'CHANGAN', 'HONGXING', 'SCION', 'NASH', 'MONTEZA', 'LINCOLN', 'SATURN', 'MERCEDES BENZ', 'JIANG CHANGE', 'SACHS', 'MG', 'JIN JIAN', 'PASSAGGIO', 'GREAT WALL MOTOR', 'HYOSUNG', 'CMC', 'MINI', 'XIANFENG', 'LOTUS', 'VERUCCI', 'HONLEI', 'NECKAR', 'HAOJIANG', 'HUANSONG', 'NATSUKI', 'LANCIA', 'MAGIRUS DEUTZ', 'HISUN', 'SUKYAMA', 'EAGLE', 'LUCKY LION', 'JINCHENG', 'FORD', 'KEEWAY', 'SACHS BIKES', 'ACB', 'CHEVROLET', 'FASTER', 'SCOOTER', 'CHANGHE', 'DUCATI', 'YADEA', 'TRIWIL', 'APRILIA', 'MAZDA', 'VAISAND', 'CARIBE', 'SMART', 'TIANDA', 'BUYANG', 'INTERNATIONAL', 'VOLVO', 'SM', 'ECOBICIS', 'MAX MOTOR', 'KAWASAKI', 'POLARIS RANGER', 'HUMMER', 'TARANTULA', 'FERRARI', 'LANDWIND', 'KTM', 'BAIC', 'BAER BAGULET', 'DUST', 'USW MOTORS', 'ZIMMER', 'OAKLAND', 'DESOTO', 'XINGYUE', 'WESTFIELD', 'BRONCO', 'CHERY', 'FIRENZE', 'FRIBEST', 'LMX', 'ZILI MOTORS', 'AG', 'POLARIS', 'MZ', 'AKT', 'CAGIVA', 'ZQ MOTORS', 'ROLLS ROYCE', 'GOMOTOR', 'AUTOKRAFT', 'EKA MOTORS', 'BSA', 'AUTO UNION', 'XINLING', 'ZONGSHEN', 'ACURA', 'JOYNER', 'HILTRAYKER', 'HAMMERHEAD', 'HUSQVARNA', 'SIMCA', 'DINLI', 'ZANELLA', 'PONTIAC', 'NITRO', 'CADILLAC', 'MOTO GUZZI', 'BETA', 'SUKIDA', 'HILLMAN', 'DERBI', 'GMC', 'VENTO', 'JET UKM', 'UNICO', 'FIAT', 'HALEI', 'EAGLE CARGO', 'BECK', 'ROA', 'PANZER', 'MITSUBISHI', 'GSMOON', 'SUPERFORMANCE', 'SKYGO', 'YAMAHA', 'SINGER', 'KART', 'AMW', 'YUGO', 'LIANGZI', 'POLARIS ATV', 'COLMOVE', 'FENGCHI', 'DACIA', 'CARTER BROTHERS', 'YAMATI', 'LINHAI', 'LOTUS - LML', 'SKOOT\nMOTORCYCLES', 'MCLAREN', 'ALEKO', 'WANXIN', 'HONDA', 'URAL', 'BOMBARDIER', 'SMC', 'TX MOTORS', 'HENRY J', 'MERCURY', 'SSANGYONG', 'KIA', 'HAFEI', 'TEMPEST', 'ASTON MARTIN', 'SP@ZZIO', 'BRONTO', 'ELEPHANT POWER', 'AMC', 'PACKARD', 'LADA', 'IOTA', 'ACM ANGELﾂｴS', 'FUXIN', 'ROVER', 'SENKE', 'VESPA', 'TYCO', 'BENSOON', 'BORGWARD', 'CHANA', 'BUICK', 'GBMCO', 'KANCHAO', 'SANLG', 'SKODA', 'KONCEO', 'MESSERSCHMITT', 'ACE MOTOR', 'KIAMASTER', 'JONWAY', 'LIANMEI MOTOR', 'TITANIA', 'PIAGGIO', 'TOURING', 'CATERHAM', 'HERO', 'U.S.W.MOTORS', 'AUTO BIANCHI', 'MGU', 'BOURGET', 'SLNG', 'ZHENGLI', 'AUPACO', 'WCR', 'ESSEX', 'FEIZHEN', 'DAIHATSU', 'ATV', 'KINLON', 'GILERA', 'CONT. MARK', 'N.S.U', 'KINROAD', 'FAW', 'SHENKE', 'BRILLIANCE', 'MV AGUSTA', 'TMEC', 'PLYMOUTH', 'OPEL', 'KAZUKI', 'FULU', 'RIDER', 'TALON', 'ZHONGHUA', 'ROKETA', 'RENAULT', 'VECTRIX', 'DAYANG', 'JMSTAR', 'KAXAMOTOS', 'MTK', 'CATFLYER', 'KAISER', 'MGB', 'YAKEY', 'YITAKI', 'VOLGA', 'ZERO', 'MORRIS', 'JAWA', 'RLX', 'MD BIKES', 'MORINI', 'TATA', 'SAAB', 'HARLEY DAVIDSON', 'AYCO', 'XINYANG', 'CHRYSLER', 'TVS', 'LINTEX', 'RIEJU', 'UAZ', 'CHOPPER NATION', 'OLTCIT', 'LA SALLE', 'ISUZU', 'PEUGEOT', 'F.S.O.', 'ATM', 'GOES', 'CFMOTO', 'ENERGY MOTION', 'AUTECO BAJAJ', 'HAOMEN', 'PANTERA', 'ACCURO', 'OLDSMOBILE', 'APRILEV', 'CHECKER', 'BEIJING', 'MORGAN', 'ALFA ROMEO', 'ILLUSION', 'ARCTIC CAT', 'AVANTI', 'TONGKO', 'KAZUMA', 'NIKITA', 'SUZUKI', 'AUTECO', 'LONCIN', 'MOTOKART', 'BASHAN', 'GUZI', 'ZUMY', 'WEST', 'UNITED MOTORS', 'EUROPAMOTOS', 'EMOTIRE', 'LAMBORGHINI', 'ZASTAVA', 'SEAT', 'SUPERMOTO', 'DAEWOO', 'AMPLE', 'GEELY', 'GREAT WALL', 'AVA', 'APRIL', 'SHINERAY', 'JIANGSU', 'LEXUS', 'TELDIUX', 'LAMBRETA', 'HUDSON', 'ROYAL ENFIELD', 'HUSABERG', 'LINGYUN', 'HUALIN', 'WILLYGER', 'JINFENG', 'YAKIMA', 'BENTLEY', 'TIXXON', 'STUDEBAKER', 'RAMBLER', 'JINGLONG', 'TAO TAO', 'HISUN TIGER', 'LIFAN', 'WARTBURG', 'GAZ', 'KYMCO', 'ACCURA', 'YINGANG', 'DATSUN', 'NISSAN', 'BIMOTA', 'PIONEER', 'ATV RACING', 'AUDI', 'BOSS ATV', 'MURAVEY', 'BUELL', 'M.G.U', 'JINLUN', 'VOLKSWAGEN', 'CHINSU', 'ARIEL', 'JAC', 'SANYA', 'CITROEN', 'AUSTIN', 'GEO', 'ZHONGNENG', 'HTA', 'DUKAR', 'CARTER', 'QINGQI', 'ZHEJIANG', 'WANHU', 'BENELLI', 'CUSTOM CHROME', 'LAND ROVER', 'TOYOTA', 'BRP CAN AM', 'BAJAJ', 'DKW', 'SUBARU', 'UM', 'JIANGNAN GLOW', 'HYUNDAI', 'CONCORDE', 'SIGMA', 'PORSCHE', 'JAGUAR', 'GAS GAS', 'AMM', 'SCOUTY', 'VICTORY', 'BYD', 'IZHMASH', 'POLONEZ', 'APRIL EV', 'DS', 'DODGE', 'JIALING', 'KHOOBRA', 'ZID', 'VAUXHALL', 'CHAMPION\nPERFOMANCE', 'MIKILON', 'INDIAN', 'STUDEBACKER', 'KYOTO', 'ON THE ROAD AGAIN', 'MOEPED', 'GOGGOMOBIL', 'KAYAK', 'TRIUMPH']

In [27]:
vehiculos[vehiculos.CLASE == 'Motocicleta']

Empty DataFrame
Columns: [CLASE, MARCA, LINEA]
Index: []

In [28]:
vehiculos.CLASE.unique()
tipos= vehiculos.CLASE.unique()

In [29]:
numvehiculos = len(vehiculos.CLASE.unique())

In [62]:
clasesVehiculos =  pd.DataFrame([(i,tipos[i]) for i in range(numvehiculos)], columns=('id','nombreClase'))

In [63]:
clases

   id          nombreVehiculo
0   0               AUTOMOVIL
1   1             MOTOCICLETA
2   2    MOTOCARRO\nELECTRICO
3   3               MOTOCARRO
4   4              CUATRIMOTO
5   5  MOTOCICLETA\nELECTRICA
6   6            MOTOTRICICLO

In [64]:
clasesVehiculos[clasesVehiculos.nombreClase == "MOTOCARRO\nELECTRICO"]["id"]

2    2
Name: id, dtype: int64

In [162]:
def getIDvehicle(nombreVehiculo):
    """Recibe string"""
    return int(clasesVehiculos[clasesVehiculos.nombreClase == nombreVehiculo]["id"])

In [73]:
print(getIDvehicle("AUTOMOVIL"))

0    0
Name: id, dtype: int64

In [88]:
MarcaVehiculos = vehiculos[["CLASE","MARCA"]]

In [74]:
agrupacionvehiculos= vehiculos.groupby(['CLASE','MARCA'])

In [97]:
def makeTableMarca():
    k = 0
    lista =[]
    for i,j in agrupacionvehiculos.indices:
        lista.append((k,getIDvehicle(i),j))
        
        k += 1
    return pd.DataFrame(lista, columns=('id','idClase','nombreMarca'))

## se crea segunda tabla

In [103]:
VehiculosMarca = makeTableMarca()

In [126]:
def getIDMarca(nombreMarca, idclase):
    tmp = VehiculosMarca[VehiculosMarca.nombreMarca == nombreMarca ][["id",'idClase']]
    return int(tmp[tmp.idClase == idclase]['id'])

In [125]:
getIDMarca('AKT',4)

153    153
Name: id, dtype: int64

In [151]:
vehiculos.shape[0]

7085

In [163]:
def quelohagatodo():
    lista = []
    k= 0
    for i in range(vehiculos.shape[0]):
        marca = vehiculos.iloc[0].MARCA
        nombre = vehiculos.iloc[0].LINEA
        clase = vehiculos.iloc[0].CLASE
        idv = getIDvehicle(clase)
        idm = getIDMarca(marca,idv)
        lista.append((k,idv,idm,nombre))
        k+=1
        
    return pd.DataFrame(lista, columns=('id','idClase','idMarca','nombreMarca'))

In [165]:
VehiculosLinea = quelohagatodo()

In [166]:
VehiculosLinea.head()

   id  idClase  idMarca nombreMarca
0   0        0        0       ACURA
1   1        0        0       ACURA
2   2        0        0       ACURA
3   3        0        0       ACURA
4   4        0        0       ACURA

In [133]:
clasesVehiculos.head()

   id           nombreClase
0   0             AUTOMOVIL
1   1           MOTOCICLETA
2   2  MOTOCARRO\nELECTRICO
3   3             MOTOCARRO
4   4            CUATRIMOTO

In [104]:
VehiculosMarca.head()

   id  idClase   nombreMarca
0   0        0        ACCURA
1   1        0         ACURA
2   2        0         ALEKO
3   3        0    ALFA ROMEO
4   4        0  ASTON MARTIN

In [107]:
print(getIDvehicle("AUTOMOVIL"))

0    0
Name: id, dtype: int64

In [ ]:
VehiculosMarca.to_csv('')
clasesVehiculos.to_csv('')
VehiculosLinea.to_csv()